# Convert Lao ASCII to Unicode
# Author: Frank Xayachack

message = "ºñ­­šÁ´ú­¢ðû£¸¾´êö©¦º® £¸¾´¹­û¾»ñ¡ Áì½¦ö©Ä¦ ¹ù¾¨À©š À«ò¤¥½ª¾¡Á©©¡½¨ñ¤Ä¯Áìú­Àª½®¾­Àêò¤²øìö¤­ðû¾ Î‡¤ Áì½ ­¿û¦º¤ ¢¼­À¯ñ­®ö©¥ö®§˜­ À²¾½¸ú¾´ñ­´ó¹ì¾¨¦öû­"
laounicode = ["ກ","ຂ","ຄ","ງ","ຈ","ສ","ຊ","ຍ","ດ","ຕ","ຖ","ທ","ນ","ນ","ບ","ປ","ຜ","ຝ","ພ","ຟ","ມ","ຢ","ລ","ຣ","ວ","ຫ","ອ","ຮ","ະ","າ","ິ","ີ","ຶ","ື","ຸ","ູ","ເ","ແ","ໂ","ໍ","ັ","ົ","ໃ","ໄ","່","້","໊","໋","ໜ​","ໝ","ຼ","ີ້","ິ້","ຳ","ຶ່","ຽ","ັ້"," "]
laoascii = ["¡","¢","£","¤","¥","¦","§","¨","©","ª","«","ê","ß","­","®","¯","°","±","²","³","´","µ","ì","ë","¸","¹","º","»","½","¾","ò","ó","ô","õ","÷","ø","À","Á","Â","ð","ñ","ö","Ã","Ä","ú","û","ü","ý","Î","Ï","ù","š","™","¿","‡","¼","˜"," "]

for x in range(len(message)):
    idx = laoascii.index(message[x])
    print(laounicode[idx], end="")